# 24th february pandas assignment

Q1. List any five functions of the pandas library with execution.

Ans 

1.pandas deals with the structure data ,dataframe (tabular data).

2. It fetch dataset from different sources like csv,excel, html,feature mongdb etc.

3. It helps to read the different dataset with the help of pd.read_csv.

4. It helps to manipulate different dataset like cleaning , extracting etc.

5. It give statistical details like mean, standard deviation percentile etc.

In [1]:
import pandas as pd  # importing panda library

df = pd.read_csv('titanic_dataset.csv')  #1. reading csv file 
df.head()  #2. extracting first five dataset
df.tail() # 3. extracting last five dataset

df.size  # 4.returning size of the dataset
df.columns  # 5.returning columns of the dataset
df.info() # to get all the datatype information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [2]:
# 6. groupby operation

df_grouped  = df.groupby('Age')
df_grouped.first()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Age,,,,,,,,,,,
0.42,804,1,3,"Thomas, Master. Assad Alexander",male,0,1,2625,8.5167,None,C
0.67,756,1,2,"Hamalainen, Master. Viljo",male,1,1,250649,14.5000,None,S
0.75,470,1,3,"Baclini, Miss. Helene Barbara",female,2,1,2666,19.2583,None,C
0.83,79,1,2,"Caldwell, Master. Alden Gates",male,0,2,248738,29.0000,None,S
0.92,306,1,1,"Allison, Master. Hudson Trevor",male,1,2,113781,151.5500,C22 C26,S
...,...,...,...,...,...,...,...,...,...,...,...
70.00,673,0,2,"Mitchell, Mr. Henry Michael",male,0,0,C.A. 24580,10.5000,B22,S
70.50,117,0,3,"Connors, Mr. Patrick",male,0,0,370369,7.7500,None,Q
71.00,97,0,1,"Goldschmidt, Mr. George B",male,0,0,PC 17754,34.6542,A5,C
74.00,852,0,3,"Svensson, Mr. Johan",male,0,0,347060,7.7750,None,S
80.00,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,0,0,27042,30.0000,A23,S

In [3]:
df['Age'].fillna('missing',inplace = True)
df['Age'].isna().sum()

0

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [4]:
import numpy as np
arr=np.array([[1,2,3,4],[5,6,7,8],[9,88,44,32]])
df=pd.DataFrame(arr,columns = ['A','B','C','D'])
df

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  88  44  32

In [5]:
# or 
data = {'A' : [1,2,3,4,5,1,2],
        'B' : ['a','b','c','d','e','a','b'],
        'C' : [1.1,2.2,3.3,4.4,5.5,1.1,2.2]
       }

df = pd.DataFrame(data)
df

   A  B    C
0  1  a  1.1
1  2  b  2.2
2  3  c  3.3
3  4  d  4.4
4  5  e  5.5
5  1  a  1.1
6  2  b  2.2

In [6]:
new_index = list(range(1,2*len(df),2))
new_index

[1, 3, 5, 7, 9, 11, 13]

In [7]:
df.index = new_index
df

    A  B    C
1   1  a  1.1
3   2  b  2.2
5   3  c  3.3
7   4  d  4.4
9   5  e  5.5
11  1  a  1.1
13  2  b  2.2

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [8]:
l = [10 ,20,30,40,50]
df = pd.DataFrame(l,columns = ['Values'])
df

   Values
0      10
1      20
2      30
3      40
4      50

In [9]:
df[0:3]

   Values
0      10
1      20
2      30

In [10]:
df.iloc[0:3]

   Values
0      10
1      20
2      30

In [11]:
df.loc[0:2]

   Values
0      10
1      20
2      30

In [12]:
data = {'Values' : [10,20,30,40,50],
        'B' : ['a','b','c','d','e'],
        'C' : [1.1,2.2,3.3,4.4,5.5]
       }
df = pd.DataFrame(data)
df

   Values  B    C
0      10  a  1.1
1      20  b  2.2
2      30  c  3.3
3      40  d  4.4
4      50  e  5.5

In [13]:
# funtion to sum first threee nos

def sum_col(df):
    sum = 0
    count = 0
    for i in df['Values']:
        sum = sum+i
        count+=1
        if count >=3:
            break
    return sum

In [14]:
sum_col(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
data = {'Text' : ['Harry is a good boy','sally lives under a tree',
                  'Bob thinks he is smart','Lukas looks ugly',
                  'Timothy is standing on water'] }

data

df = pd.DataFrame(data)
df

                           Text
0           Harry is a good boy
1      sally lives under a tree
2        Bob thinks he is smart
3              Lukas looks ugly
4  Timothy is standing on water

In [16]:
def word_count(x):
    count = len(x.split(' '))
    return count
df['Word_count'] = df['Text'].apply(word_count)
df

                           Text  Word_count
0           Harry is a good boy           5
1      sally lives under a tree           5
2        Bob thinks he is smart           5
3              Lukas looks ugly           3
4  Timothy is standing on water           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

Answer

DataFrame.size is an attribute that returns the total number of elements in the dataframe. It is calculated as the product of the number of rows and columns in the dataframe.

In [17]:
df.size

10

DataFrame.shape is an attribute that returns a tuple containing the number
of rows and columns in the dataframe.The number of rows is the first element of the 
tuple, and the number of columns is the second element of the tuple.

In [18]:
df.shape

(5, 2)

Q6. Which function of pandas do we use to read an excel file?

# Answer

The pandas.read_excel() function of pandas is used to read an excel file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'.

Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [19]:
# Answer

data = {'Email' : ['john.doe@gmail.com','sally.carpenter@gmail.com',
                   'Bob@gmail.com','Lukas.speed@gmail.com','Timothy@gmail.com']
       }
data
df = pd.DataFrame(data)
df

                       Email
0         john.doe@gmail.com
1  sally.carpenter@gmail.com
2              Bob@gmail.com
3      Lukas.speed@gmail.com
4          Timothy@gmail.com

In [20]:
usernames = []

for each_mail in df['Email']:
    name = each_mail.split('@')
    usernames.append(name[0])

In [21]:
df['username'] = usernames
df

                       Email         username
0         john.doe@gmail.com         john.doe
1  sally.carpenter@gmail.com  sally.carpenter
2              Bob@gmail.com              Bob
3      Lukas.speed@gmail.com      Lukas.speed
4          Timothy@gmail.com          Timothy

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:


A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows: A B C


1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [22]:
data = {'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2],
       }
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [23]:
def function(df):
    i = 0
    index =[]
    for element_A , element_B in zip(df['A'],df['B']):
        if element_A >5 and element_B < 10:
            index.append(i)
            
        i+=1
    new_df = df.loc[index]
    return new_df

In [24]:
new_df = function(df)
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [25]:
data = {'Values' : [10,20,30,40,50] }
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [26]:
def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median,std

mean,median,std = calculate_stats(df)

print(f'mean : {mean}, median : {median},standard deviatin :{std}')

mean : 30.0, median : 30.0,standard deviatin :15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [27]:
data = {'Sales' : [1.1,2.2,3.3,4.4,5.5,1.1,2.2,1.1,2.2,3.3,4.4,5.5,1.1,2.2]}

df = pd.DataFrame(data)
df.head()

   Sales
0    1.1
1    2.2
2    3.3
3    4.4
4    5.5

In [28]:
def moving_average(df):
    df['movingAverage'] = df['Sales'].rolling(window = 7,min_periods = 1).mean()
    return df

In [29]:
new_df = moving_average(df)
new_df.head()

   Sales  movingAverage
0    1.1           1.10
1    2.2           1.65
2    3.3           2.20
3    4.4           2.75
4    5.5           3.30

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
    
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:

Date Weekday

0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [30]:
data = {'Date' : [ '2023-01-01','2023-01-02','2023-01-04','2023-01-05']}

df= pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-04
3  2023-01-05

In [31]:
def weekly_func(df):
    weekdays = []
    for each_date in df['Date']:
        temp = each_date.split('-')
        if temp[2] =='01':
            weekdays.append('Sunday')
        elif temp[2] == '02':
            weekdays.append('Monday')
        elif temp[2] =='03':
            weekdays.append('Tuesday')
        elif temp[2] =='04':
            weekdays.append('Wednesday')
        elif temp[2] =='05':
            weekdays.append('Thursday')
        elif temp[2] =='06':
            weekdays.append('Friday')
            
    df['weekdays'] = weekdays
    return df

In [32]:
new_df = weekly_func(df)
new_df

         Date   weekdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-04  Wednesday
3  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [33]:
data = {
    'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04',
            '2023-01-05','2023-01-06']
    
}

df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06

In [36]:
def selected_dates(df):
    start_date= '2023-01-03'
    end_date = '2023-01-05'
    mask = (df['Date'].dt.date >= pd.datetime(start_date).date()) & (df['Date'].dt.date <= pd.datetime(end_date).date())
    return df.loc[mask]

In [37]:
df['Date'] = pd.to_datetime(df['Date'])

new_data = selected_dates(df)
new_data

/tmp/ipykernel_99/3703263280.py:4: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  mask = (df['Date'].dt.date >= pd.datetime(start_date).date()) & (df['Date'].dt.date <= pd.datetime(end_date).date())

TypeError: 'str' object cannot be interpreted as an integer

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
import pandas as pd